DataProcessors/РасчетАВСФилиала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РасчетАВСФилиала</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/РасчетАВСФилиала/Ext/ObjectModule.bsl
Процедура РасчетИУстановкаABCXYZПоказателей() Экспорт
	
	ЗапросАВС = Новый Запрос;
	ЗапросАВС.Текст = ПолучитьТекстЗапроса();
	
	ЗапросАВС.УстановитьПараметр("ВидНоменклатуры",Константы.ВидНоменклатурыПоУмолчанию.Получить());
	
	ЗапросАВС.УстановитьПараметр("ОсновнойСклад",Константы.ОсновнойСклад.Получить());
	
	СписокИсключить = Новый СписокЗначений;
	
	ГруппаРеклама = Константы.НоменклатураРеклама.Получить();	
	Если ЗначениеЗаполнено(ГруппаРеклама) Тогда
		СписокИсключить.Добавить(ГруппаРеклама);
	КонецЕсли;  
	
	ГруппаУценка = Константы.ГруппаНоменклатурыУценка.Получить();
	Если ЗначениеЗаполнено(ГруппаУценка) Тогда
		СписокИсключить.Добавить(ГруппаУценка);
	КонецЕсли;
	
	ЗапросАВС.УстановитьПараметр("СписокИсключений",СписокИсключить);  
	
	КоличествоДнейРасчетаПоказателей = Константы.АВСАнализКоличествоДнейРасчета.Получить();
	
	ЗапросАВС.УстановитьПараметр("ДатаНач",НачалоДня(ТекущаяДата()-?(КоличествоДнейРасчетаПоказателей = 0 , 365 , КоличествоДнейРасчетаПоказателей)*86400));
	ЗапросАВС.УстановитьПараметр("ДатаКон",ТекущаяДата());
	
	РезультатЗапросаАВС = ЗапросАВС.Выполнить().Выгрузить();
	
	Если НЕ РезультатЗапросаАВС.Количество() = 0 Тогда
		
		мНакопительныйПроцент = 0;
		
		ПроцентА = Константы.АВСАнализГруппаA.Получить();
		ПроцентВ = Константы.АВСАнализГруппаB.Получить();
		ПроцентС = Константы.АВСАнализГруппаC.Получить();
		ПроцентД = Константы.АВСАнализГруппаD.Получить(); 
		
		КоличествоX = Константы.АВСАнализГруппаX.Получить();
		КоличествоY = Константы.АВСАнализГруппаY.Получить();
		
		Для Каждого СтрокаРезультата Из РезультатЗапросаАВС Цикл
			
			мНакопительныйПроцент = мНакопительныйПроцент+СтрокаРезультата.Процент;  
			
			Если  СтрокаРезультата.Процент > 0 Тогда
				СтрокаРезультата.НакопительныйПроцент = ?(мНакопительныйПроцент>100,100,мНакопительныйПроцент);
			КонецЕсли;
			
			Если мНакопительныйПроцент <= ПроцентА Тогда
				СтрокаРезультата.КатегорияАВС = "A";
			ИначеЕсли СтрокаРезультата.НакопительныйПроцент > ПроцентА И СтрокаРезультата.НакопительныйПроцент <= ПроцентВ Тогда
				СтрокаРезультата.КатегорияАВС = "B"; 
			ИначеЕсли СтрокаРезультата.НакопительныйПроцент > ПроцентВ И СтрокаРезультата.НакопительныйПроцент <= ПроцентС Тогда
				СтрокаРезультата.КатегорияАВС = "C";
			ИначеЕсли СтрокаРезультата.НакопительныйПроцент > ПроцентС И СтрокаРезультата.НакопительныйПроцент <= ПроцентД  Тогда
				СтрокаРезультата.КатегорияАВС = "D";
			Иначе
				
				Если СтрокаРезультата.Остаток > 0 Тогда
					СтрокаРезультата.КатегорияАВС = "E";
				КонецЕсли;					
				
			КонецЕсли;
			
			Если НЕ СтрокаРезультата.КатегорияАВС = "E" Тогда   
				
				Если СтрокаРезультата.КоличествоРеализаций  > КоличествоX Тогда
					СтрокаРезультата.КатегорияXYZ = "X";
				ИначеЕсли СтрокаРезультата.КоличествоРеализаций  <= КоличествоX И СтрокаРезультата.КоличествоРеализаций  >= КоличествоY Тогда
					СтрокаРезультата.КатегорияXYZ = "Y";				
				Иначе
					СтрокаРезультата.КатегорияXYZ = "Z";
				КонецЕсли;			
				
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(СтрокаРезультата.КатегорияАВС) Тогда
				
				СтрокаРезультата.КатегорияABCXYZ = СокрЛП(СтрокаРезультата.КатегорияАВС+""+СтрокаРезультата.КатегорияXYZ);	
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаРезультата.КатегорияABCXYZ) Тогда 
				
				Попытка
					СтрокаРезультата.УстановитьКатегориюАВС = Справочники.АВСКлассификацияНоменклатуры[СтрокаРезультата.КатегорияABCXYZ+"_филиал"];
				Исключение
					
				Конецпопытки;
				
			КонецЕсли;
			
		КонецЦикла; 
		
		
		Для Каждого СтрокаУстановкаКатегории Из РезультатЗапросаАВС Цикл
			
			Если ЗначениеЗаполнено(СтрокаУстановкаКатегории.УстановитьКатегориюАВС) И НЕ СтрокаУстановкаКатегории.УстановитьКатегориюАВС = СтрокаУстановкаКатегории.ТекущаяКатегорияАВС Тогда
				
				НоменклатураОбъект = СтрокаУстановкаКатегории.Номенклатура.Получитьобъект();
				НоменклатураОбъект.ОбменДанными.Загрузка = Истина; 
				НоменклатураОбъект.ГруппаАВСФилиала = СтрокаУстановкаКатегории.УстановитьКатегориюАВС;   
				
				Попытка
					НоменклатураОбъект.Записать();
				Исключение
					
				КонецПопытки;
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция  ПолучитьТекстЗапроса()Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПродажиОбороты.СтоимостьОборот < 0
	|				ТОГДА 0
	|			ИНАЧЕ ПродажиОбороты.СтоимостьОборот
	|		КОНЕЦ КАК ЧИСЛО(20, 10)) КАК СуммаПродаж
	|ПОМЕСТИТЬ ВТ_Продажи
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			,
	|			НЕ Номенклатура В ИЕРАРХИИ (&СписокИсключений)
	|				И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ПродажиОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Остаток
	|ПОМЕСТИТЬ ВТ_ОстаткиНаСкладах
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&ДатаКон,
	|			Склад = &ОсновнойСклад
	|				И НЕ Номенклатура В ИЕРАРХИИ (&СписокИсключений)
	|				И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ТоварыНаСкладахОстатки
	|ГДЕ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_продажи.СуммаПродаж) КАК СуммаПродаж
	|ПОМЕСТИТЬ ВТ_ИтогПродажи
	|ИЗ
	|	ВТ_Продажи КАК ВТ_продажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Продажи.Номенклатура КАК Номенклатура,
	|	ВТ_Продажи.СуммаПродаж КАК СуммаПродаж,
	|	ВТ_Продажи.СуммаПродаж / ВТ_ИтогПродажи.СуммаПродаж * 100 КАК Процент,
	|	0 КАК Остаток
	|ПОМЕСТИТЬ ВТ_ИтоговаяТаблица
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогПродажи КАК ВТ_ИтогПродажи
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВТ_ИтогПродажи.СуммаПродаж > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ОстаткиНаСкладах.Номенклатура,
	|	0,
	|	0,
	|	ВТ_ОстаткиНаСкладах.Остаток
	|ИЗ
	|	ВТ_ОстаткиНаСкладах КАК ВТ_ОстаткиНаСкладах
	|ГДЕ
	|	ВТ_ОстаткиНаСкладах.Остаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажиОбороты.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументов
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Регистратор,
	|			НЕ Номенклатура В ИЕРАРХИИ (&СписокИсключений)
	|				И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ПродажиОбороты
	|ГДЕ
	|	НЕ ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг) ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ТаблицаДокументов.Номенклатура) КАК Товар
	|ПОМЕСТИТЬ ВТ_ОбщееКоличествоТоваров
	|ИЗ
	|	ВТ_ТаблицаДокументов КАК ВТ_ТаблицаДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_ТаблицаДокументов.Регистратор) КАК Реализация
	|ПОМЕСТИТЬ ВТ_ОбщееКоличествоРеализаций
	|ИЗ
	|	ВТ_ТаблицаДокументов КАК ВТ_ТаблицаДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбщееКоличествоРеализаций.Реализация / ВТ_ОбщееКоличествоТоваров.Товар КАК СреднееКоличество
	|ПОМЕСТИТЬ ВТСреднееКоличествоТоваровВРеализации
	|ИЗ
	|	ВТ_ОбщееКоличествоТоваров КАК ВТ_ОбщееКоличествоТоваров
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ОбщееКоличествоРеализаций КАК ВТ_ОбщееКоличествоРеализаций
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ИтоговаяТаблица.Номенклатура,
	|	СУММА(ВТ_ИтоговаяТаблица.СуммаПродаж) КАК СуммаПродаж,
	|	СУММА(ВТ_ИтоговаяТаблица.Процент) КАК Процент,
	|	СУММА(ВТ_ИтоговаяТаблица.Остаток) КАК Остаток,
	|	СУММА(0) КАК НакопительныйПроцент,
	|	МАКСИМУМ("" "") КАК КатегорияАВС,
	|	МАКСИМУМ(ОКР(ЕСТЬNULL(ВТ_ТаблицаДокументов.Регистратор, 0) / ВТСреднееКоличествоТоваровВРеализации.СреднееКоличество, 2)) КАК КоличествоРеализаций,
	|	МАКСИМУМ("" "") КАК КатегорияXYZ,
	|	МАКСИМУМ(""  "") КАК КатегорияABCXYZ
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_ИтоговаяТаблица КАК ВТ_ИтоговаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаДокументов КАК ВТ_ТаблицаДокументов
	|		ПО ВТ_ИтоговаяТаблица.Номенклатура = ВТ_ТаблицаДокументов.Номенклатура,
	|	ВТСреднееКоличествоТоваровВРеализации КАК ВТСреднееКоличествоТоваровВРеализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИтоговаяТаблица.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.АВСКлассификацияНоменклатуры.ПустаяСсылка) КАК УстановитьКатегориюАВС,
	|	ВТ_Итог.Номенклатура.ГруппаАВСФилиала КАК ТекущаяКатегорияАВС,
	|	ВТ_Итог.СуммаПродаж КАК СуммаПродаж,
	|	ВТ_Итог.Остаток,
	|	ВТ_Итог.Процент,
	|	ВТ_Итог.НакопительныйПроцент,
	|	ВТ_Итог.КоличествоРеализаций,
	|	ВТ_Итог.КатегорияАВС,
	|	ВТ_Итог.КатегорияXYZ,
	|	ВТ_Итог.КатегорияABCXYZ
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|ГДЕ
	|	(ВТ_Итог.СуммаПродаж > 0
	|			ИЛИ ВТ_Итог.Остаток > 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СуммаПродаж УБЫВ";
	Возврат ТекстЗапроса;  
	
КонецФункции
